cases/00-tutorials/hartmann1d-postpatch/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                  
  \\      /  F ield           OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration       Website:  www.openfoam.com
    \\  /    A nd             Version:  v2506
     \\/     M anipulation   
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  laminar;


// ************************************************************************* //
